import { ChangeDetectionStrategy, Component, OnInit } from '@angular/core';

@Component({
  selector: 'ngx-detail',
  templateUrl: './detail.component.html',
  styleUrls: ['./detail.component.scss'],
  changeDetection: ChangeDetectionStrategy.OnPush,
})
export class DetailComponent implements OnInit {

  markdown = '## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ## 줄바꿈을    이렇게    하면    될려낭    ';

  constructor() { }

  ngOnInit(): void {
  }

  onReady() {
    console.log('준비됨');
  }

}
